# 1.	Укажите значения логических переменных K, L, M, N, при которых значение логического выражения
# (НЕ K ИЛИ M) ИЛИ (НЕ L ИЛИ M ИЛИ N)
# будет ложным1.
# K     L       M       N
# 1     0       1       1
# 1     0       1       0
# 1     0       0       1
# 1     0       0       0


K = 1
L = 1
M = 1
N = 0

f = (not K or M) or ( not L or M or N)
print(f)

# 2.	Найдите значения выражений:
# a.	0 ИЛИ 1 И НЕ (0 ИЛИ 1)
# b.	1 ИЛИ 0 И 1 И 1 И 0 ИЛИ 1
# c.	((1 ИЛИ 0) И (1 И 1))
# d.	((А ИЛИ 0) ИЛИ В И 1) И 0


f2 = 0 or 1 and not (0 or 1)
print('f2 = ', f2)

f3 = 1 or 0 and 1 and 1 and 0 or 1
print('f3 = ', f3)

f4= ((1 or 0) and (1 and 1))
print('f4 = ', f4)

A = 0
B = 0
f5 = ((A or 0) or B and 1) and 0
print('f5 = ', f5)

#X1	X2	X3	X4	F
#1	0	0	1	1
#0	1	1	1	1
#1	0	1	0	0
#Какой из трех функций соответствует этот фрагмент?
#a.	(X1 ˅ ¬X2) ˄ (¬X3 ˅ X4)
#b.	(¬ X1 ˅ X3) ˄ X2 ˅ X4
#c.	X1 ˄ X2 ˅ (¬ X3 ˅ (X1 ˅ X4))

X1 = 1
X2 = 0
X3 = 0
X4 = 1

f6 = (X1 or not X2) and (not X3 or X4)
print('f6 = ', f6)
f7 = (not X1 or X3) and X2 or X4    # для этой формулы
print('f7 = ', f7)
f8 = X1 and X2 or (not X3 or (X1 or X4))
print('f8 = ', f8)

#4.	Сколько решений имеет уравнение:
#¬((a ˄ ¬ b) ˅(¬a ˄ b)) ˅ (c ˄ d) = 1

a = 1
b = 1
c = 1
d = 1
f9 = not ((a and not b) or (not a and b)) or (c and d) == 1
print('f9 = ', f9)

#5.	Мама, прибежавшая на звон разбившейся вазы, застала всех трех своих сыновей в совершенно невинных позах:
# Саша, Ваня и Коля делали вид, что произошедшее к ним не относится.
#-	Кто это сделал? - спросила мама.
#-	Коля не бил по мячу, - сказал Саша. - Это сделал Ваня.
#-	Разбил Коля, Саша не играл в футбол дома. - Ответил Ваня.
#-	Так я и знала, что вы друг на дружку сваливать будете, - рассердилась мама. - Ну а ты что скажешь? - спросила она Колю.
#-	Не сердись, мамочка! Я знаю, что Ваня не мог этого сделать. - сказал Коля.
#Оказалось, что один из мальчиков солгал, а двое - говорили правду. Кто разбил вазу?


#A - разбил Коля   not A  Коля не разбивал
#B - Разбил Ваня not B Ваня не разбивал
#C - Саша не разбивал



A = 0
B = 0
C = 0

f10 = (not A and B) or (A and not B)
f11 = (A and not C) or (not A and C)
f12 = not B or B