result = 0
for i in range(100):
    result += i
    print(result)

x = 42
if x <= 0:
    print('Negative: ')
else:
    print('Pozitive rezult')

#Написать программу, которая будет конвертировать значение температуры из градусов Цельсия в Фаренгейты и наоборот.
#Входные данные: 60C, 45F, ….
#Результат: 140F, 7C, ….
#Расчетные формулы:

#c = (F-32) * 5/9
#F = C * 9/5 + 32

#Тестовые значения:
#60С     140F
#90C     194F
#100C    212F

#45F     7.22С
#90F     32.22С
#125f    51.67С

#50a     wrong value

t = '76F'
suffix = t[-1] #проверяем температура задана в C или А
val = int(t[:-1])
if suffix in ['C', 'c']:
    conv_val = val * 9/5 + 32
    res = str(round(conv_val, 2)) + 'F'
elif suffix in ['F', 'f']:
    conv_val = (val - 32) * 5/9
    res = str(round(conv_val, 2)) + 'C'
else:
    res = 'wrong value'
print(t, ' is ', res)

#Напишите программу расчета суммы двух целых чисел. Однако если
# полученная сумма находится в интервале от 15 до 20, вывести на экран
#число 20

a = 10
b = 8
sum = a + b
if sum in range(15, 21):
    print(20)
else:
    print(sum)

#Даны длины сторон треуголлника. Проверить, является ли треугольник
#равносторонним, равнобедернным или разносторонним.

k = 10
m = 20
n = 20

if k == m == n:
    print('Треугольник равносторонний')
elif k == m or m == n or n == k:
    print('Треугольник равнобедренный')
else:
    print('Треугольник разносторонний')

#Написать программму решения квадратного уравнения
# ax^2 + bx + c = 0
# Исходные данные: a,b,c
# Результат: корни квадратного уравнения х1 и Х2 или сообщение
# о том что корней нет

from math import sqrt

a1 = 4
b1 = 10
c1 = 5
D = b1**2 - 4 * a1 * c1
if D >= 0:
    x1 = (-b1 + sqrt(D)) / (2 * a1)
    x2 = (-b1 - sqrt(D)) / (2 * a1)
    print(round(x1), round(x2))
else:
    print('корней нет')

#Составить программу нахождения действительных и комплексных корней
#квадратного уравнения ax^2 + bx + c = 0.
#Исходные данные: a, b, c
#Результат: действительные корни: x1 и x2, -
#или комплексные корни: x1 + ix2 и x1 - ix2

#Тестовые значения:
#a   b   c       x1      x2
#2   4   10      -1+2i   -1-2i
#4   10  5       -0.69   -1.81

from math import sqrt, fabs

A1 = 4
B1 = 10
C1 = 5
D = B1**2 - 4 * A1 * C1
if D >= 0:
    x1 = (-B1 + sqrt(D)) / (2 * A1)
    x2 = (-B1 - sqrt(D)) / (2 * A1)
    print(round(x1), round(x2))
else:
    x1 = -B1 / (2 * A1)
    x2 = sqrt(fabs(D))/(2 * A1)
    print(complex(x1, x2), complex(x1, -x2))

