# 1.	Дан список из 10 элементов. Удалить все элементы, расположенные справа от элемента,
# следующего за максимальным.

l = [1, 9, -12, 30, 22, -10, 13, 27, 9, -3]
max_l = l.index(max(l))
print('Max: ', max_l)
dell = l[:max_l]
print('Modifaed list: ', dell)

#2.	Дан список из 10 элементов. Удалить все элементы, расположенные между минимальным и максимальным элементами.

k = [0, -30, 3, 30, 3, -10, 13, 27, 9, -3]
max_k = k.index(max(k))
print('Max: ', max_k)
min_k = k.index(min(k))
print('Min: ', min_k)
dell = k[min_k:max_k]
print('Modifaed: ', dell)

#3.	Дан список из 10 элементов.
# Изменить его таким образом, чтобы все положительные элементы оказались в начале списка, причем, чем больше элемент,
# тем ближе к началу списка он должен быть.

n = [0, -30, 3, 30, 3, -10, 13, 27, 9, -3]
n.sort(reverse=True)
print(n)

#4.	В кружке по борьбе занимаются 8 человек:
# Круглов Алексей, Ворожейкин Борис, Митин Сергей, Алешин Сергей, Кутиков Владимир, Круглов Денис,
# Бочкин Иван и Мечников Алексей. Выведите список учеников в алфавитном порядке.
# Подсчитайте, сколько в группе Сергеев, Денисов и Алексеев? Есть ли в группе однофамильцы?
# Через два месяца после начала занятий Бочкин Иван перестал посещать кружок, однако пришли новые мальчики:
# Фомин Петр и Краснов Дмитрий. Отредактируйте список учеников соответствующим образом.

m = ['Круглов Алексей', 'Ворожейкин Борис', 'Митин Сергей', 'Алешин Сергей', 'Кутиков Владимир', 'Круглов Денис',
     'Бочкин Иван', 'Мечников Алексей']

m.sort()
print(m)

first = sum('Сергей' in name for name in m)
print('amount sergey: ', first)

two = sum('Денис' in name for name in m)
print('amount denys: ', two)

three = sum('Алексей' in name for name in m)
print('amount aleksey: ', three)