# Тема 1: “Типы и модель данных”
# 1.	Выполнить следующие действия:
# a.	создать переменную А и присвоить ей значение 5. Вывести на экран тип данных и идентификатор созданного объекта.
A = 5
print('Type: ', type(A))
print('Id: ', id(A))

# b.создать переменную В и присвоить ей значение 12. Вывести на экран тип данных и идентификатор созданного объекта.
B = 12
print('Type: ', type(B))
print('Id: ', id(B))

# c.создать переменную С и присвоить ей значение 5.7. Вывести на экран тип данных и идентификатор созданного объекта.
C = 5.7
print('Type: ', type(C))
print('Id: ', id(C))

# d.присвоить переменной А значение 12. Проверить, изменился ли ее идентификатор, и совпадает ли он с идентификатором
# переменной В. Почему?
A = 12
print(A is B)
#в Python числа от -5 до 256 кэшируются, и для них используются одни и те же объекты в памяти (индентификатор)

# e.	присвоить переменной А значение переменной С. Проверить, изменился ли ее идентификатор,
# и совпадает ли он с идентификатором переменной С. Почему?
A = C
print('Id: ', id(A))
#в Python числа от -5 до 256 кэшируются, и для них используются одни и те же объекты в памяти (индентификатор)

# f.путем множественного присваивания создать переменные D, E и F и присвоить каждой из них значение 125.
# Вывести на экран и сравнить между собой идентификаторы созданных объектов.
D = E = F = 125
print(id(D), id(E), id(125))

#Тема 2: “Тип None. Логический тип данных”
#1.	Создать переменные a, b, c и присвоить им значения 9, 17 и 5 соответственно. Проверить выполнение следующих условий:

a, b, c = 9, 17, 5
#a.	a больше b
print(a > b)
#b.	a не равно разности b и c
print(a != b - c)
#c.	b равно сумме a и c
print(b == a + c)
#d.	c меньше или равно сумме a и b
print(c <= a + b)
#e.	a меньше b, но больше c
print(a < b and a > c)
#f.	b больше a или b больше c
print(b > a or b > c )

#2.	Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.
#Дано логическое выражение ¬А ˄ (С ˅ А) ˄ (В ˅ ¬С).
# Укажите значения логических переменных A, B и С, при которых значение выражения будет ложным
k = None
print('My none variable: ', k is None)

#Дано логическое выражение ¬А ˄ (С ˅ А) ˄ (В ˅ ¬С).
# Укажите значения логических переменных A, B и С, при которых значение выражения будет ложным

A1 = 2
B1 = 0
C1 = 6
result = not A1 and (C1 or A1) and (B1 or not C1)
print(result)