# Тема 1: “Типы и модель данных”
# 1.	Выполнить следующие действия:
# a.	создать переменную А и присвоить ей значение 5. Вывести на экран тип данных и идентификатор созданного объекта.
A = 5
print('Type: ', type(A))
print('Id: ', id(A))

# b.создать переменную В и присвоить ей значение 12. Вывести на экран тип данных и идентификатор созданного объекта.
B = 12
print('Type: ', type(B))
print('Id: ', id(B))

# c.создать переменную С и присвоить ей значение 5.7. Вывести на экран тип данных и идентификатор созданного объекта.
C = 5.7
print('Type: ', type(C))
print('Id: ', id(C))

# d.присвоить переменной А значение 12. Проверить, изменился ли ее идентификатор, и совпадает ли он с идентификатором
# переменной В. Почему?
A = 12
print(A is B)
#в Python числа от -5 до 256 кэшируются, и для них используются одни и те же объекты в памяти (индентификатор)

# e.	присвоить переменной А значение переменной С. Проверить, изменился ли ее идентификатор,
# и совпадает ли он с идентификатором переменной С. Почему?
A = C
print('Id: ', id(A))
#в Python числа от -5 до 256 кэшируются, и для них используются одни и те же объекты в памяти (индентификатор)

# f.путем множественного присваивания создать переменные D, E и F и присвоить каждой из них значение 125.
# Вывести на экран и сравнить между собой идентификаторы созданных объектов.
D = E = F = 125
print(id(D), id(E), id(125))