#Дано биквадратное уравнение
#ax4 + bx2 + c = 0
#Найти все его действительные корни.
#Входные данные: a, b, c
#Результат: x1, x2, x3, x4

#Биквадратное уравнение вида:
  # ax4 + bx2 + c = 0
#может быть легко превращено в квадратное уравнение с помощью замены:
   #x2 = y
   #ay2 + by + c = 0


from math import sqrt

a = 2
b = 1
c = 3

D = b ** 2 - 4 * a * c

if D < 0:
    print('Корней нет: ')
else:
    y1 = (-b + sqrt(D)) / (2 * a)
    y2 = (-b - sqrt(D)) / (2 * a)

    if y1 < 0 and y2 < 0:
        print('Корней нет.')
    else:
        if y1 >= 0:
            x1 = sqrt(y1)
            x2 = -x1
            x3 = sqrt(y2)
            x4 = -x3
            print(f'Корни: {x1}, {x2}, {x3}, {x4}')
        elif y2 >= 0:
            x1 = sqrt(y2)
            x2 = -x1
            x3 = sqrt(y1)
            x4 = -x3
            print(f'Корни: {x1}, {x2}, {x3}, {x4}')
        else:
            print('Корней нет.')