#i = 5
#while i < 6:
    #print(i)
    #i += 1 # что бы не было зацикливания

#Вывести на экран значения функции
		#y = (e^sin(x)) * cos()

#на отрезке [0, П] с шагом 0.1.

from math import pi, e, sin, cos
x = 0
while x <= pi:
    y = e**sin(x) * cos(x)
    print(round(x, 2), round(y, 3))
    x += 0.1
#Найти наибольший общий делитель (НОД) натуральных чисел А и В

a = 25
b = 15
while a!=b:
    if a > b:
        a -= b
    else:
        b -= a
print('НОД: ', a)

#вычислить сумму натуральных четных чисел,
# не превышающих заданное число N 2,4,6,8,10
N = 20
sum = 0
i = 2
while i <= N:
    sum += i
    i += 2
print(sum)

#Дан список: [1452, 11.23, 1+2j, True, 'hello, python!',
#(30, -1), [5, 12], {'class': 'v', 'section': 'A'}].
#Вывести на экран значение и тип данных для каждого элемента списка.

l = [1452, 11.23, 1+2j, True, 'hello, python!', (0, -1), [5, 12], {'class': 'v', 'section': 'A'}]

i = 0
while i<len(l):
    elem = l[i]
    print(elem, type(elem))
    i += 1

# Дан список чисел: [12, 15, 32, 42, 55, 75, 122, 132, 150, 180, 200].
# Вывести на экран все числа из списка, которые делятся на 5 и не превышают число 150.
#

m = [12, 15, 32, 42, 55, 75, 122, 132, 150, 180, 200]
i = 0
while i<len(m):
    elem = m[i]
    if elem%5 == 0 and elem<=150:
        print(elem)
    i += 1
#	Выведите на экран все числа в интервале от 1500 до 2700 включительно,
#	которые кратны 7 и имеют среди своих множителей число 5.
k = list(range(1500, 2700))
print(k)
i = 0
while i<len(k):
    elem = k[i]
    if elem % 7 == 0 and elem % 5 == 0:
        print(elem)
    i += 1
# 	Выведите на экран все числа в интервале от 0 до 6 включительно, кроме чисел 3 и 5.
q = list(range(0, 7))
i = 0
while i <= 6:
    elem = q[i]
    if elem != 3 and elem != 5:
        print(elem)
    i += 1
# Выведите на экран все числа в интервале от 100 до 400 включительно,
# каждое из которых состоит только из четных цифр. Например: 200, 260, 282, 400 и т.д.
num = 100

while num <= 400:
    all_even = True
    num_str = str(num)
    i = 0
    while i < len(num_str):
        if int(num_str[i]) % 2 != 0:
            all_even = False
            break
        i += 1
    if all_even:
        print(num)
    num += 1

#	Напишите программу для расчета факториала числа N, т.е. произведения всех чисел от 1 до N включительно.

number = 8
factorial = 1

while number > 1:
    factorial *= number
    number -= 1

print("Factorial of number: ", factorial)

#Найдите сумму чисел в следующей последовательности:
# 2, 22, 222, 2222, …, 2(n), - где n - количество разрядов в последнем числе.
# Например, при n = 5 последнее число будет 22222, а сумма чисел в последовательности 24690.
n = 5 #колличество разрядов
last_num = 0 # итоговое число
i = 1  # счетчик разрядов
sum = 0 # 2 + 22 + 222 + 2222 + 22222 = 24690
while n > 0:
    last_num += 2 * i
    i *= 10
    n -= 1
    sum += last_num

print(sum)