#i = 5
#while i < 6:
    #print(i)
    #i += 1 # что бы не было зацикливания

#Вывести на экран значения функции
		#y = (e^sin(x)) * cos()

#на отрезке [0, П] с шагом 0.1.

from math import pi, e, sin, cos
x = 0
while x <= pi:
    y = e**sin(x) * cos(x)
    print(round(x, 2), round(y, 3))
    x += 0.1
#Найти наибольший общий делитель (НОД) натуральных чисел А и В

a = 25
b = 15
while a!=b:
    if a > b:
        a -= b
    else:
        b -= a
print('НОД: ', a)

#вычислить сумму натуральных четных чисел,
# не превышающих заданное число N 2,4,6,8,10
N = 20
sum = 0
i = 2
while i <= N:
    sum += i
    i += 2
print(sum)

#Дан список: [1452, 11.23, 1+2j, True, 'hello, python!',
#(30, -1), [5, 12], {'class': 'v', 'section': 'A'}].
#Вывести на экран значение и тип данных для каждого элемента списка.

l = [1452, 11.23, 1+2j, True, 'hello, python!', (0, -1), [5, 12], {'class': 'v', 'section': 'A'}]

i = 0
while i<len(l):
    elem = l[i]
    print(elem, type(elem))
    i += 1

# Дан список чисел: [12, 15, 32, 42, 55, 75, 122, 132, 150, 180, 200].
# Вывести на экран все числа из списка, которые делятся на 5 и не превышают число 150.
#

m = [12, 15, 32, 42, 55, 75, 122, 132, 150, 180, 200]
i = 0
while i<len(m):
    elem = m[i]
    if elem%5 == 0 and elem<=150:
        print(elem)
    i += 1
#	Выведите на экран все числа в интервале от 1500 до 2700 включительно,
#	которые кратны 7 и имеют среди своих множителей число 5.
k = list(range(1500, 2700))
print(k)
i = 0
while i<len(k):
    elem = k[i]
    if elem % 7 == 0 and elem % 5 == 0:
        print(elem)
    i += 1
